Revit 2026 API

# TextElementSymbol Property

---

Get the type of the TextElement object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TextElementType Symbol { get; }
```
```vb
Public ReadOnly Property Symbol As TextElementType
	Get
```
```cpp
public:
property TextElementType^ Symbol {
	TextElementType^ get ();
}
```
```fsharp
member Symbol : TextElementType with get
```

#### Property Value

TextElementType

The user can call this property to get the related type.

#### Reference

TextElement Class

Autodesk.Revit.DB Namespace